devdnl/dnx-rtos/src/system/drivers/i2c/stm32f4/i2c_lld.c
        *rdcnt = n;

        return err;
}

//==============================================================================
/**
 * @brief  Function transmit selected amount bytes to I2C bus
 * @param  hdl                  device handle
 * @param  src                  data source
 * @param  count                number of bytes to transfer
 * @param  wrcnt                number of written bytes
 * @return One of errno value (errno.h)
 */
//==============================================================================
int _I2C_LLD__transmit(I2C_dev_t *hdl, const u8_t *src, size_t count, size_t *wrcnt)
{
        int     err  = EIO;
        ssize_t n    = 0;
        I2C_t  *i2c  = get_I2C(hdl);

        clear_send_address_event(hdl);

#if USE_DMA > 0
        if (count >= 3 && I2C_HW[hdl->major].use_DMA) {
                u32_t dmad = _DMA_DDI_reserve(0, I2C_HW[hdl->major].DMA_tx_stream_pri);
                if (dmad == 0) {
                        dmad = _DMA_DDI_reserve(0, I2C_HW[hdl->major].DMA_tx_stream_alt);
                }

                if (dmad) {
                        CLEAR_BIT(i2c->CR2, I2C_CR2_ITBUFEN | I2C_CR2_ITERREN | I2C_CR2_ITEVTEN);

                        _DMA_DDI_config_t config;
                        config.arg      = _I2C[hdl->major];
                        config.callback = DMA_callback;
                        config.release  = false;
                        config.PA       = cast(u32_t, &i2c->DR);
                        config.MA[0]    = cast(u32_t, src);
                        config.NDT      = count;
                        config.FC       = DMA_SxFCR_FTH_0 | DMA_SxFCR_FS_2;
                        config.CR       = ((I2C_HW[hdl->major].DMA_channel & 7) << DMA_SxCR_CHSEL_Pos)
                                        | DMA_SxCR_MINC | DMA_SxCR_DIR_0;

                        err = _DMA_DDI_transfer(dmad, &config);
                        if (!err) {
                                err = wait_for_event_DMA(hdl);
                                if (!err) {

                                        /*
                                         *  Master transmitter: In the interrupt routine after the EOT
                                         *  interrupt, disable DMA requests then wait for a BTF event
                                         *  before programming the Stop condition.
                                         */
                                        err = wait_for_event_poll(hdl, I2C_SR1_BTF,
                                                                  _I2C_TIMEOUT_BYTE_TRANSFER);
                                        if (!err) {
                                                n = count;
                                        } else {
                                                printk("I2C: write not finished correctly %d", err);
                                        }
                                } else {
                                        printk("I2C: DMA event error %d", err);
                                }
                        } else {
                                printk("I2C: DMA transfer error %d", err);
                        }

                        _DMA_DDI_release(dmad);
                        goto finish;

                } else {
                        printk("I2C: DMA write channel in use, using polling mode");
                }
        }
#endif
        {
                while (count) {
                        err = wait_for_event_poll(hdl, I2C_SR1_TXE, _I2C_TIMEOUT_BYTE_TRANSFER);
                        if (!err) {
                                i2c->DR = *src++;
                                n++;
                                count--;
                        } else {
                                break;
                        }
                }
        }

        if (n && !err) {
                err = wait_for_event_poll(hdl, I2C_SR1_TXE, _I2C_TIMEOUT_BYTE_TRANSFER);
                if (!err) {
                        err = wait_for_event_poll(hdl, I2C_SR1_BTF, _I2C_TIMEOUT_BYTE_TRANSFER);
                }
        }

#if USE_DMA > 0
        finish:
#endif

        *wrcnt = n;

        return err;
}

//==============================================================================
/**
 * @brief  Function enable peripheral in slave mode.
 * @param  hdl                  device handle
 * @return One of errno value (errno.h)
 */
//==============================================================================
int _I2C_LLD__slave_mode_setup(I2C_dev_t *hdl)
{
        I2C_t *i2c = get_I2C(hdl);

        if (hdl->config.slave_mode) {

                i2c->OAR1 = (1 << 14) // not used but documentation say to set this bit...
                          | (hdl->config.address & 0x3FF)
                          | (hdl->config.addr_10bit ? I2C_OAR1_ADDMODE : 0);

                i2c->OAR2 = 0;

        } else {

                CLEAR_BIT(i2c->CR1, I2C_CR1_ACK);

                i2c->OAR1 = 0;
                i2c->OAR2 = 0;
        }

        return ESUCC;
}

//==============================================================================
/**
 * @brief  Function wait for I2C start/address condition event.
 * @param  hdl                  device handle
 * @param  event                event type and timeout
 * @return One of errno value (errno.h)
 */
//==============================================================================
int _I2C_LLD__slave_wait_for_selection(I2C_dev_t *hdl, I2C_selection_t *event)
{
        I2C_t *i2c = get_I2C(hdl);

        CLEAR_BIT(i2c->CR1, I2C_CR1_STOP);
        SET_BIT(i2c->CR1, I2C_CR1_ACK);

        int err = wait_for_event_IRQ(hdl, I2C_SR1_ADDR, event->timeout_ms);
        if (!err) {
                event->RD_addr = (i2c->SR2 & I2C_SR2_TRA);
        }

        return err;
}

//==============================================================================
/**
 * @brief  Function transmit bytes to master device.
 * @param  hdl                  device handle
 * @param  src                  source buffer
 * @param  count                number of bytes to transfer
 * @param  wrctr                write counter
 * @return One of errno value (errno.h)
 */
//==============================================================================
int _I2C_LLD__slave_transmit(I2C_dev_t *hdl, const u8_t *src, size_t count, size_t *wrctr)
{
        I2C_t *i2c = get_I2C(hdl);
        int    err = ESUCC;

